tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/core"
tap "homebrew/services"
tap "homebrew/cask-fonts"

brew "coreutils"
brew "git"
brew "jq"
brew "tree"
brew "pygments"
brew "ifstat"

tap "koekeishiya/formulae"
tap "FelixKratz/formulae"
brew "koekeishiya/formulae/yabai"
brew "koekeishiya/formulae/skhd"
brew "FelixKratz/formulae/sketchybar"

#tap "cmacrae/formulae"
#brew "cmacrae/formulae/spacebar"

cask "iterm2"
cask "visual-studio-code"
cask "alacritty"
cask "font-fira-code"
cask "font-fira-code-nerd-font"

brew 'yabai', restart_service: :changed
brew 'skhd', restart_service: :changed
#brew 'spacebar', restart_service: :changed
