tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/core"
tap "homebrew/services"
tap "homebrew/cask-fonts"
tap "koekeishiya/formulae"
tap "FelixKratz/formulae"
tap "amazon/amazon"

# Utilities
brew "coreutils"
brew "git"
brew "jq"
brew "tree"
brew "pygments"
brew "ifstat"
brew "grep"
brew "mdcat"

# Required for YouCompleteMe
brew "vim"
brew "go"

# Mac customization
brew "koekeishiya/formulae/yabai"
brew "koekeishiya/formulae/skhd"
brew "FelixKratz/formulae/sketchybar"
brew "neovim"

# spacebar - UNUSED
#tap "cmacrae/formulae"
#brew "cmacrae/formulae/spacebar"

# Amazon
brew "ninja-dev-sync"

# Casks
cask "iterm2"
cask "visual-studio-code"
cask "font-fira-code"
cask "font-fira-code-nerd-font"
cask "font-fontawesome"
cask "dcv-viewer"
cask "balance-lock"
cask "boop"
cask "bluesnooze"

# Unused terminals
#cask "wezterm"
#cask "kitty"
#cask "alacritty"

# Service auto restarts
brew 'yabai', restart_service: :changed
brew 'skhd', restart_service: :changed
#brew 'spacebar', restart_service: :changed
